cmsis-svd/cmsis-svd/data/Nuvoton/M4521_v1.svd
       <register>
          <name>EADC_DDAT0</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>EADC_DDAT0</displayName>
          <description>A/D Double Data Register 0 for Sample Module 0</description>
          <addressOffset>0x100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>A/D Conversion Results\nThis field contains 12 bits conversion results.\nWhen the DMOF (EADC_CTL[9]) is set to 0, 12-bit ADC conversion result with unsigned format will be filled in RESULT [11:0] and zero will be filled in RESULT [15:12].\nWhen DMOF (EADC_CTL[9]) set to 1, 12-bit ADC conversion result with 2'complement format will be filled in RESULT [11:0] and signed bits to will be filled in RESULT [15:12].</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>Overrun Flag\nIf converted data in RESULT[15:0] has not been read before new conversion result is loaded to this register, OV is set to 1. It is cleared by hardware after EADC_DDAT register is read.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is recent conversion result</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Data in RESULT (EADC_DATn[15:0], n=0~3) is overwrite</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is not valid</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Double data in RESULT (EADC_DDATn[15:0]) is valid</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-only</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="EADC_DDAT0">
          <name>EADC_DDAT1</name>
          <displayName>EADC_DDAT1</displayName>
          <description>A/D Double Data Register 1 for Sample Module 1</description>
          <addressOffset>0x104</addressOffset>
       </register>
       <register derivedFrom="EADC_DDAT0">
          <name>EADC_DDAT2</name>
          <displayName>EADC_DDAT2</displayName>
          <description>A/D Double Data Register 2 for Sample Module 2</description>
          <addressOffset>0x108</addressOffset>
       </register>
       <register derivedFrom="EADC_DDAT0">
          <name>EADC_DDAT3</name>
          <displayName>EADC_DDAT3</displayName>
          <description>A/D Double Data Register 3 for Sample Module 3</description>
          <addressOffset>0x10C</addressOffset>
       </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
